Revit 2027 API
FamilyInstance.ExtensionUtility Property
Property to check whether the instance can be extended and return the interface for extension operation.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IExtension ExtensionUtility { get; }
Public ReadOnly Property ExtensionUtility As IExtension
	Get
public:
property IExtension^ ExtensionUtility {
	IExtension^ get ();
}
member ExtensionUtility : IExtension with get
Property Value
IExtension
Remarks
If the family instance can not support extension operation, it returns null
See Also
Reference
FamilyInstance Class
Autodesk.Revit.DB Namespace